src/test/resources/org/springframework/ws/axis1/case2/contractfirst/soap_11/rpcEncoded12plainarrays-req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns1:echo soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://codefirst.case2.axis1.ws.springframework.org">
			<param href="#id0" />
			<param2 href="#id1" />
		</ns1:echo>
		<multiRef id="id0" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:Param1" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns2="http://codefirst.case2.axis1.ws.springframework.org">
			<list soapenc:arrayType="soapenc:byte[2]" xsi:type="soapenc:Array">
				<list href="#id2" />
				<list href="#id3" />
			</list>
			<number href="#id4" />
			<param2 href="#id5" />
			<param3list soapenc:arrayType="ns2:Param3[3]" xsi:type="soapenc:Array">
				<param3list href="#id6" />
				<param3list href="#id7" />
				<param3list href="#id8" />
			</param3list>
			<string xsi:type="soapenc:string">str (String)</string>
		</multiRef>
		<multiRef id="id1" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns3:Param2" xmlns:ns3="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<bd href="#id9" />
			<list soapenc:arrayType="soapenc:string[3]" xsi:type="soapenc:Array">
				<list xsi:type="soapenc:string">str1</list>
				<list xsi:type="soapenc:string">str2</list>
				<list xsi:type="soapenc:string">str3</list>
			</list>
			<number href="#id10" />
			<param3List soapenc:arrayType="ns3:Param3[2]" xsi:type="soapenc:Array">
				<param3List href="#id11" />
				<param3List href="#id12" />
			</param3List>
			<param3Tab soapenc:arrayType="ns3:Param3[3]" xsi:type="soapenc:Array">
				<param3Tab href="#id13" />
				<param3Tab href="#id14" />
				<param3Tab href="#id15" />
			</param3Tab>
		</multiRef>
		<multiRef id="id9" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:decimal" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37.98</multiRef>
		<multiRef id="id8" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns4:Param3" xmlns:ns4="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id4" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:long" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37</multiRef>
		<multiRef id="id10" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:int" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">44</multiRef>
		<multiRef id="id6" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns5:Param3" xmlns:ns5="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id11" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns6:Param3" xmlns:ns6="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id12" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns7:Param3" xmlns:ns7="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id5" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns8:Param2" xmlns:ns8="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<bd href="#id17" />
			<list soapenc:arrayType="soapenc:string[3]" xsi:type="soapenc:Array">
				<list xsi:type="soapenc:string">str1</list>
				<list xsi:type="soapenc:string">str2</list>
				<list xsi:type="soapenc:string">str3</list>
			</list>
			<number href="#id10" />
			<param3List soapenc:arrayType="ns8:Param3[2]" xsi:type="soapenc:Array">
				<param3List href="#id18" />
				<param3List href="#id19" />
			</param3List>
			<param3Tab soapenc:arrayType="ns8:Param3[3]" xsi:type="soapenc:Array">
				<param3Tab href="#id20" />
				<param3Tab href="#id21" />
				<param3Tab href="#id22" />
			</param3Tab>
		</multiRef>
		<multiRef id="id2" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:byte" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">36</multiRef>
		<multiRef id="id3" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:byte" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">-102</multiRef>
		<multiRef id="id7" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns9:Param3" xmlns:ns9="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id13" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns10:Param3" xmlns:ns10="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id15" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns11:Param3" xmlns:ns11="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id14" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns12:Param3" xmlns:ns12="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id19" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns13:Param3" xmlns:ns13="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id18" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns14:Param3" xmlns:ns14="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id21" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns15:Param3" xmlns:ns15="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id16" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:long" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">3</multiRef>
		<multiRef id="id22" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns16:Param3" xmlns:ns16="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id17" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:decimal" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37.98</multiRef>
		<multiRef id="id20" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns17:Param3" xmlns:ns17="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id16" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
	</soapenv:Body>
</soapenv:Envelope>
